app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin '
---
    public function login()
    {
        $session = session();
        $db = \Config\Database::connect();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $db->table('users')->where('username', $username)->get()->getRowArray();