app/Controllers/Produk.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $this->checkAuth();
        $db = \Config\Database::connect();

        $keyword = $this->request->getGet('keyword');
        $id_kategori = $this->request->getGet('kategori');

        if ($keyword) {
            $produk = $this->produkModel->search($keyword);
        } elseif ($id_kategori) {
            $produk = $this->produkModel->filterByCategory($id_kategori);
        } else {
            $produk = $this->produkModel->getProdukWithKategori();
        }

        $data = [
            'title'      => 'Dashboard | BIKE BIKE AJA STORE',
            'produk'     => $produk,
            'kategori'   => $db->table('kategori')->get()->getResultArray(),

SELECT `riwayat_stok`.*, `produk`.`nama_sepeda`
FROM `riwayat_stok`
JOIN `produk` ON `produk`.`kode_sepeda` = `riwayat_stok`.`kode_sepeda`
ORDER BY `tanggal` DESC
---
    public function rekap()
    {
        $this->checkAuth();
        $db = \Config\Database::connect();

        $keyword = $this->request->getGet('keyword');

        $builder = $db->table('riwayat_stok')
            ->select('riwayat_stok.*, produk.nama_sepeda')
            ->join('produk', 'produk.kode_sepeda = riwayat_stok.kode_sepeda');

        if ($keyword) {
            $builder->groupStart()
                    ->like('produk.nama_sepeda', $keyword)
                    ->orLike('riwayat_stok.kode_sepeda', $keyword)
                    ->orLike('riwayat_stok.keterangan', $keyword)
                    ->groupEnd();
        }

        $riwayat = $builder->orderBy('tanggal', 'DESC')->get()->getResultArray();

SELECT *
FROM `produk`
WHERE `produk`.`kode_sepeda` = 'SPD-003'
UPDATE `produk` SET `stok` = 7
WHERE `produk`.`kode_sepeda` IN ('SPD-003')
INSERT INTO `riwayat_stok` (`kode_sepeda`, `tipe`, `jumlah`, `keterangan`, `tanggal`) VALUES ('SPD-003', 'Keluar', 1, 'Penjualan Unit', '2026-01-17 15:47:26')
---
    public function laporan()
    {
        $this->checkAuth();
        $db = \Config\Database::connect();
        $kode = $this->request->getPost('kode_sepeda');
        $jumlah = (int)$this->request->getPost('jumlah_terjual');

        $produk = $this->produkModel->find($kode);

        if ($produk) {
            $stok_baru = $produk['stok'] - $jumlah;
            if ($stok_baru < 0) {
                return redirect()->to(base_url('produk'))->with('error', 'Stok tidak mencukupi untuk dilaporkan!');
            }

            $this->produkModel->update($kode, ['stok' => $stok_baru]);

            $db->table('riwayat_stok')->insert([
                'kode_sepeda'=> $kode,
                'tipe'       => 'Keluar',
                'jumlah'     => $jumlah,
                'keterangan' => 'Penjualan Unit',
                'tanggal'    => date('Y-m-d H:i:s')
            ]);

SELECT *
FROM `produk`
WHERE `produk`.`kode_sepeda` = 'SPD-001'
UPDATE `produk` SET `nama_sepeda` = 'BMX TDR 390H1!111111111', `id_kategori` = '3', `stok` = 2, `harga` = '3440000.00'
WHERE `produk`.`kode_sepeda` IN ('SPD-001')
---
    public function update()
    {
        $this->checkAuth();
        $db = \Config\Database::connect();
        $kode = $this->request->getPost('kode_sepeda');
        $stokBaru = (int)$this->request->getPost('stok');

        $produkLama = $this->produkModel->find($kode);

        $this->produkModel->update($kode, [
            'nama_sepeda' => $this->request->getPost('nama_sepeda'),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'stok'        => $stokBaru,
            'harga'       => $this->request->getPost('harga'),
        ]);