app/Models/ProdukModel.php

    public function getProdukWithKategori()
    {
        return $this->select('produk.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = produk.id_kategori', 'left')
                    ->findAll();
---
SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`

    public function filterByCategory($id_kategori)
    {
        return $this->select('produk.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = produk.id_kategori', 'left')
                    ->where('produk.id_kategori', $id_kategori)
                    ->findAll();
---
SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
WHERE `produk`.`id_kategori` = '10'